_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 298, 298, 32)      896       
_________________________________________________________________
activation_11 (Activation)   (None, 298, 298, 32)      0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 149, 149, 32)      0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 147, 147, 64)      18496     
_________________________________________________________________
activation_12 (Activation)   (None, 147, 147, 64)      0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 73, 73, 64)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 71, 71, 64)        36928     
_________________________________________________________________
activation_13 (Activation)   (None, 71, 71, 64)        0         
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 35, 35, 64)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 78400)             0         
_________________________________________________________________
dense_5 (Dense)              (None, 64)                5017664   
_________________________________________________________________
activation_14 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 65        
_________________________________________________________________
activation_15 (Activation)   (None, 1)                 0         
=================================================================
Total params: 5,074,049
Trainable params: 5,074,049
Non-trainable params: 0
_________________________________________________________________
